[
	{
		"country": "Norway",
		"inventions": [
			{
				"name": "Cheese Slicer",
				"inventor": "Thor Bjørklund",
				"year": "1925",
				"information": {
					"general": "In 1925, Thor Bjørklund designed the cheese slicer to make even, thin slices of cheese effortlessly.",
					"description": "He crafted it from wood and steel, with a wire stretched across a flat blade. It glides through semi-hard cheeses like Edam or brunost, turning a tedious task into a quick, precise motion.",
					"extra": "Bjørklund's inspiration came from the carpenter's plane he used in his workshop. He also experimented with a butter slicer, which failed, but his cheese slicer became a European and Brazilian kitchen classic."
				},
				"image": "images/inventions/europe/norway/cheese_slicer.webp"
			},
			{
				"name": "Paper Clip",
				"inventor": "Johan Vaaler",
				"year": "1899",
				"information": {
					"general": "In 1899, Johan Vaaler invented the paper clip to hold sheets together neatly without damaging them.",
					"description": "Made from bent wire, it creates tension that keeps papers aligned. Vaaler's design was simple yet ingeniously effective.",
					"extra": "The idea reportedly came from the need to manage documents in offices efficiently. Later refinements improved durability, and today it's a ubiquitous office tool worldwide."
				},
				"image": "images/inventions/europe/norway/paper_clip.webp"
			},
			{
				"name": "Clip-on Ski Binding",
				"inventor": "Bruno R. Linge",
				"year": "1920s",
				"information": {
					"general": "In the 1920s, Bruno Linge developed the first clip-on ski binding to improve skiing safety.",
					"description": "Constructed from metal and leather, the binding securely fastens boots to skis, offering control while reducing the risk of falls.",
					"extra": "Linge was inspired by the growing popularity of skiing in Norway. His invention influenced modern ski bindings and made the sport more accessible and safer."
				},
				"image": "images/inventions/europe/norway/ski_binding.webp"
			}
		]
	},
	{
		"country": "Italy",
		"inventions": [
			{
				"name": "Piano",
				"inventor": "Bartolomeo Cristofori",
				"year": "c. 1700",
				"information": {
					"general": "Around 1700, Bartolomeo Cristofori created the piano to allow musicians to play both soft and loud notes.",
					"description": "He engineered hammers to strike strings, giving the keyboard expressive power. Cristofori's use of hardwood, metal strings, and precise mechanics produced rich tones and dynamic range.",
					"extra": "Inspired by the limitations of the harpsichord, he experimented with action mechanisms over decades. His designs evolved into the grand and upright pianos that define modern music halls and home instruments."
				},
				"image": "images/inventions/europe/italy/piano.webp"
			},
			{
				"name": "Eyeglasses",
				"inventor": "Salvino D'Armate",
				"year": "c. 1280",
				"information": {
					"general": "Salvino D'Armate is credited with making the first wearable eyeglasses in Italy around 1280.",
					"description": "Using convex lenses set in wood or metal frames balanced on the nose, these early spectacles improved vision for reading and work.",
					"extra": "The inspiration likely came from monks and scholars needing to read manuscripts. Over centuries, frame and lens materials advanced, spreading eyeglasses across Europe and evolving into countless modern designs."
				},
				"image": "images/inventions/europe/italy/eyeglasses.webp"
			},
			{
				"name": "Pasta Machine",
				"inventor": "Angelo Vitantonio",
				"year": "1800s",
				"information": {
					"general": "In the 19th century, Angelo Vitantonio built a mechanized pasta machine to streamline pasta preparation.",
					"description": "Made with metal rollers and cutting blades, it produces even pasta sheets quickly. The machine saves hours of labor compared to hand-rolling dough.",
					"extra": "Inspired by Italy's love for fresh pasta, Vitantonio refined his design through trial and error. His invention spread widely, laying the foundation for modern pasta machines used in kitchens worldwide."
				},
				"image": "images/inventions/europe/italy/pasta_machine.webp"
			}
		]
	},
	{
		"country": "Germany",
		"inventions": [
			{
				"name": "Printing Press",
				"inventor": "Johannes Gutenberg",
				"year": "1440s",
				"information": {
					"general": "In the 1440s, Johannes Gutenberg of Germany invented the movable type printing press. He aimed to make book production faster and more affordable.",
					"description": "The printing press allowed mass production of books, spreading knowledge, ideas, and literacy across Europe. Before it, books had to be copied by hand, which was slow and expensive.",
					"extra": "Gutenberg's invention changed the world, enabling the Renaissance, Reformation, and scientific revolution by making ideas accessible to many people for the first time."
				},
				"image": "images/inventions/europe/germany/printing_press.webp"
			},
			{
				"name": "Automobile",
				"inventor": "Karl Benz",
				"year": "1885",
				"information": {
					"general": "Karl Benz of Germany is credited with inventing the first practical automobile powered by an internal combustion engine.",
					"description": "The Benz Patent-Motorwagen is considered the world's first real car, marking the beginning of modern transportation as we know it today.",
					"extra": "This invention transformed how humans travel, trade, and design cities, eventually shaping the entire global automotive industry."
				},
				"image": "images/inventions/europe/germany/automobile.webp"
			},
			{
				"name": "X-ray Machine",
				"inventor": "Wilhelm Conrad Röntgen",
				"year": "1895",
				"information": {
					"general": "Wilhelm Conrad Röntgen discovered X-rays while experimenting with cathode rays in Germany.",
					"description": "This discovery made it possible to see inside the human body without surgery, revolutionizing medical diagnostics.",
					"extra": "X-ray technology became one of the most important tools in medicine, science, and security worldwide."
				},
				"image": "images/inventions/europe/germany/xray_machine.webp"
			}
		]
	},
	{
		"country": "United Kingdom",
		"inventions": [
			{
				"name": "Steam Engine",
				"inventor": "James Watt",
				"year": "1765",
				"information": {
					"general": "In 1765, Scottish engineer James Watt improved the steam engine to make it more efficient and practical for industry.",
					"description": "The steam engine powered machines, trains, and ships, changing how goods were made and transported. It fueled the Industrial Revolution across Britain and the world.",
					"extra": "Watt's enhancements allowed engines to use less fuel and generate more power. His work helped industries grow rapidly and shaped modern economies."
				},
				"image": "images/inventions/europe/uk/steam_engine.webp"
			},
			{
				"name": "World Wide Web",
				"inventor": "Tim Berners-Lee",
				"year": "1989",
				"information": {
					"general": "British computer scientist Tim Berners-Lee invented the World Wide Web while working at CERN.",
					"description": "The World Wide Web made it possible to access and share information through websites connected by hyperlinks.",
					"extra": "It revolutionized how people learn, communicate, work, and access information across the entire globe."
				},
				"image": "images/inventions/europe/uk/world_wide_web.webp"
			},
			{
				"name": "Jet Engine",
				"inventor": "Frank Whittle",
				"year": "1937",
				"information": {
					"general": "British engineer Frank Whittle developed the first practical turbojet engine.",
					"description": "The jet engine allowed aircraft to travel significantly faster and higher than before.",
					"extra": "This invention transformed aviation, making modern commercial and military flight possible."
				},
				"image": "images/inventions/europe/uk/jet_engine.webp"
			}
		]
	},
	{
		"country": "Colombia",
		"inventions": [
			{
				"name": "Haptx / Force-Feedback Glove Prototype",
				"inventor": "Juan David Wills",
				"year": "2014",
				"information": {
					"general": "In 2014, Colombian engineer Juan David Wills built an early prototype of a force-feedback glove that later contributed to the technology behind modern haptic VR systems.",
					"description": "The prototype used pneumatic micro-valves and lightweight actuators to simulate pressure and touch sensations. It allowed users to feel resistance while interacting with virtual objects, a major step toward immersive VR experiences.",
					"extra": "Wills' early experiments were developed in Bogotá with limited resources. His research later influenced commercial haptic devices used in medical training, remote robotics, and immersive gaming."
				},
				"image": "images/inventions/south_america/colombia/haptic_glove.webp"
			},
			{
				"name": "Expandable Heart Stent",
				"inventor": "Jorge Reynolds Pombo",
				"year": "1960s",
				"information": {
					"general": "Colombian engineer Jorge Reynolds helped develop early versions of the expandable heart stent while researching cardiovascular implants.",
					"description": "The device is a tiny mesh cylinder inserted into blocked arteries. Once positioned, it expands to keep blood vessels open, improving circulation and reducing the risk of heart attacks.",
					"extra": "Reynolds is also famous for creating one of the world's first external pacemakers. His work contributed greatly to modern biomedical engineering in Latin America."
				},
				"image": "images/inventions/south_america/colombia/heart_stent.webp"
			},
			{
				"name": "Antioquia Coffee Pulper",
				"inventor": "Luis Eduardo Álvarez",
				"year": "1940s",
				"information": {
					"general": "In the 1940s, Colombian inventor Luis Eduardo Álvarez designed a mechanical coffee pulper that automated the removal of coffee cherry skins.",
					"description": "Made from metal drums and a rotating abrasive surface, the machine quickly separated beans from pulp, reducing labor and improving consistency in coffee processing.",
					"extra": "The invention became widely adopted in rural Antioquia. It increased productivity for small farmers and helped raise the quality of Colombia's globally renowned coffee industry."
				},
				"image": "images/inventions/south_america/colombia/coffee_pulper.webp"
			}
		]
	},
	{
		"country": "France",
		"inventions": [
			{
				"name": "Hot Air Balloon",
				"inventor": "Montgolfier Brothers",
				"year": "1783",
				"information": {
					"general": "In 1783, the Montgolfier brothers in France launched the first successful hot air balloon, marking humanity's first flight.",
					"description": "The balloon lifted people and objects into the air using heated air. It inspired fascination with flight and exploration of the skies.",
					"extra": "The Montgolfiers experimented with different materials and sizes, eventually carrying passengers safely. Ballooning became a popular spectacle in Europe and laid groundwork for aviation."
				},
				"image": "images/inventions/europe/france/hot_air_balloon.webp"
			},
			{
				"name": "Pasteurization",
				"inventor": "Louis Pasteur",
				"year": "1864",
				"information": {
					"general": "In 1864, Louis Pasteur developed the process of pasteurization to kill harmful microbes in liquids like milk and wine.",
					"description": "The method involves heating liquids to a specific temperature for a set time to destroy bacteria without affecting flavor. It drastically improved food safety and public health.",
					"extra": "Pasteurization is still used worldwide today for dairy, juice, and other perishable liquids, preventing countless illnesses and saving millions of lives."
				},
				"image": "images/inventions/europe/france/pasteurization.webp"
			},
			{
				"name": "Braille System",
				"inventor": "Louis Braille",
				"year": "1824",
				"information": {
					"general": "In 1824, Louis Braille, a blind Frenchman, invented the Braille system for reading and writing for visually impaired people.",
					"description": "The system uses patterns of raised dots representing letters, numbers, and punctuation. It allowed blind individuals to read independently and access education.",
					"extra": "Braille revolutionized literacy for the blind, becoming a universal tactile writing system used in schools, libraries, and everyday life worldwide."
				},
				"image": "images/inventions/europe/france/braille.webp"
			}
		]
	},
	{
		"country": "Greece",
		"inventions": [
			{
				"name": "Olympic Flame / Torch Relay",
				"inventor": "Ancient Greeks (Olympic organizers)",
				"year": "776 BCE",
				"information": {
					"general": "A ceremonial flame lit to honor the gods and symbolize the continuity of the Olympic Games.",
					"description": "The torch was carried in a relay from Olympia to the host city, a tradition to demonstrate unity, endurance, and respect.",
					"extra": "Modern Olympic torch relays are inspired directly by this ancient Greek invention, blending culture and sportsmanship."
				},
				"image": "images/inventions/europe/greece/olympic_flame.webp"
			},
			{
				"name": "Water Mill",
				"inventor": "Ancient Greek Engineers",
				"year": "3rd Century BCE",
				"information": {
					"general": "The Greeks were among the first to use water-powered mills to grind grain into flour.",
					"description": "Flowing water turned a wheel connected to grinding stones, replacing manual labor with mechanical energy.",
					"extra": "This innovation became the foundation for later industrial machines and energy use in Europe and beyond."
				},
				"image": "images/inventions/europe/greece/water_mill.webp"
			},
			{
				"name": "Archimedes' Screw",
				"inventor": "Archimedes",
				"year": "3rd Century BCE",
				"information": {
					"general": "Archimedes invented a device for raising water for irrigation and drainage purposes.",
					"description": "The screw-shaped device rotates inside a pipe or cylinder, lifting water upward as it turns.",
					"extra": "It is still used today in agriculture and water management systems around the world."
				},
				"image": "images/inventions/europe/greece/archimedes_screw.webp"
			}
		]
	},
	{
		"country": "Russia",
		"inventions": [
			{
				"name": "Periodic Table of Elements",
				"inventor": "Dmitri Mendeleev",
				"year": "1869",
				"information": {
					"general": "A systematic arrangement of chemical elements based on their atomic number, electron configurations, and recurring chemical properties.",
					"description": "Mendeleev organized elements so that elements with similar properties fell into vertical columns, predicting the existence and properties of elements yet to be discovered.",
					"extra": "This table forms the foundation of modern chemistry and is still used worldwide for scientific research and education."
				},
				"image": "images/inventions/europe/russia/periodic_table.webp"
			},
			{
				"name": "First Practical Helicopter",
				"inventor": "Igor Sikorsky",
				"year": "1939",
				"information": {
					"general": "Sikorsky developed one of the first successful single-rotor helicopters capable of controlled flight.",
					"description": "His design combined a main rotor for lift and a tail rotor for stability, setting the blueprint for most modern helicopters.",
					"extra": "Sikorsky's work revolutionized aviation, enabling vertical takeoff and landing, search-and-rescue operations, and military transport."
				},
				"image": "images/inventions/europe/russia/helicopter.webp"
			},
			{
				"name": "Tetris",
				"inventor": "Alexey Pajitnov",
				"year": "1984",
				"information": {
					"general": "A tile-matching puzzle video game that became one of the most popular and influential games in history.",
					"description": "Players rotate and place falling shapes called tetrominoes to complete horizontal lines without gaps, which then disappear, scoring points.",
					"extra": "Tetris has been adapted to nearly every gaming platform and is considered a cultural icon worldwide."
				},
				"image": "images/inventions/europe/russia/tetris.webp"
			}
		]
	},
	{
		"country": "Spain",
		"inventions": [
			{
				"name": "Chupa Chups (Lollipop)",
				"inventor": "Enric Bernat",
				"year": "1958",
				"information": {
					"general": "A popular lollipop on a stick, designed to make candy easier and cleaner to eat for children.",
					"description": "Bernat invented the idea of putting candy on a stick so it could be enjoyed without sticky fingers, revolutionizing the candy industry.",
					"extra": "The brand logo was famously designed by Salvador Dalí, and Chupa Chups became a global phenomenon."
				},
				"image": "images/inventions/europe/spain/chupa_chups.webp"
			},
			{
				"name": "Table Football (Foosball)",
				"inventor": "Valentin Gomez",
				"year": "1937",
				"information": {
					"general": "A tabletop game simulating association football, played by manipulating rods with attached figures to hit a small ball into the opponent's goal.",
					"description": "Gomez's design popularized the game in Spain and beyond, making it a widely played recreational activity in homes, bars, and clubs.",
					"extra": "Modern foosball tables have evolved in design and rules, but the basic Spanish-invented concept remains the same worldwide."
				},
				"image": "images/inventions/europe/spain/table_football.webp"
			},
			{
				"name": "Modern Classical Acoustic Guitar",
				"inventor": "Antonio de Torres Jurado",
				"year": "1850s",
				"information": {
					"general": "The modern design of the classical acoustic guitar, with a larger body, fan bracing, and improved resonance.",
					"description": "Torres standardized the guitar's shape and internal bracing, improving volume, tone, and playability, forming the basis of modern classical and flamenco guitars.",
					"extra": "His designs influenced luthiers worldwide and are still followed in modern guitar making."
				},
				"image": "images/inventions/europe/spain/acoustic_guitar.webp"
			}
		]
	},
	{
		"country": "United States",
		"inventions": [
			{
				"name": "Telephone",
				"inventor": "Alexander Graham Bell",
				"year": "1876",
				"information": {
					"general": "In 1876, Alexander Graham Bell invented the telephone to transmit voice over long distances.",
					"description": "Using wires, a diaphragm, and electromagnetic coils, it converted sound into electrical signals for instant communication.",
					"extra": "Inspired by his work on hearing devices, Bell experimented tirelessly with circuits until the first call rang through."
				},
				"image": "images/inventions/north_america/united_states/telephone.webp"
			},
			{
				"name": "Light Bulb",
				"inventor": "Thomas Edison",
				"year": "1879",
				"information": {
					"general": "In 1879, Thomas Edison successfully developed a practical and long-lasting electric light bulb.",
					"description": "The bulb used a carbon filament in a vacuum to produce light efficiently and reliably for home and industrial use.",
					"extra": "Edison tested thousands of materials for the filament before finding one that could burn long enough to be commercially viable."
				},
				"image": "images/inventions/north_america/united_states/light_bulb.webp"
			},
			{
				"name": "Airplane",
				"inventor": "Wright Brothers",
				"year": "1903",
				"information": {
					"general": "In 1903, Orville and Wilbur Wright made the first controlled, sustained flight of a powered aircraft.",
					"description": "Their airplane, the Wright Flyer, used a lightweight engine and movable control surfaces to achieve lift and stability.",
					"extra": "The Wright brothers' experimentation with gliders, wind tunnels, and control mechanisms paved the way for modern aviation."
				},
				"image": "images/inventions/north_america/united_states/airplane.webp"
			}
		]
	},
	{
		"country": "Canada",
		"inventions": [
			{
				"name": "Insulin",
				"inventor": "Frederick Banting and Charles Best",
				"year": "1921",
				"information": {
					"general": "In 1921, Banting and Best discovered insulin to treat diabetes, saving countless lives.",
					"description": "They extracted it from animal pancreases and purified it so it could regulate blood sugar safely.",
					"extra": "Their experiments combined surgical skill and chemistry, laying the foundation for modern diabetes care."
				},
				"image": "images/inventions/north_america/canada/insulin.webp"
			},
			{
				"name": "IMAX",
				"inventor": "Graeme Ferguson, Roman Kroitor, Robert Kerr, William C. Shaw",
				"year": "1967",
				"information": {
					"general": "IMAX, developed in Canada in 1967, revolutionized large-format cinema with ultra-high-resolution film.",
					"description": "The system uses larger film frames and advanced projection techniques to immerse audiences in lifelike visuals.",
					"extra": "IMAX theaters are now globally recognized for their ability to deliver intense, immersive movie experiences."
				},
				"image": "images/inventions/north_america/canada/imax.webp"
			},
			{
				"name": "Electric Wheelchair",
				"inventor": "George Klein",
				"year": "1950s",
				"information": {
					"general": "Canadian inventor George Klein created the first practical electric wheelchair to improve mobility for disabled veterans.",
					"description": "Using a motorized system, the chair allowed users to move independently, transforming rehabilitation and accessibility.",
					"extra": "Klein's innovation laid the groundwork for modern powered mobility devices used worldwide today."
				},
				"image": "images/inventions/north_america/canada/electric_wheelchair.webp"
			}
		]
	},
	{
		"country": "Mexico",
		"inventions": [
			{
				"name": "Color TV (early system)",
				"inventor": "Guillermo González Camarena",
				"year": "1940",
				"information": {
					"general": "In 1940, Camarena created an early color television system to make broadcasts more vivid.",
					"description": "His device used color wheels and filters to project images in red, green, and blue tones.",
					"extra": "He tested prototypes repeatedly at home and in studios, inspiring later global color TV standards."
				},
				"image": "images/inventions/north_america/mexico/color_tv.webp"
			},
			{
				"name": "Birth Control Pill (oral contraceptive)",
				"inventor": "Luis Ernesto Miramontes",
				"year": "1951",
				"information": {
					"general": "Miramontes co-invented the first orally active hormonal contraceptive, revolutionizing family planning worldwide.",
					"description": "He synthesized norethindrone, the key active ingredient, which could prevent ovulation when taken orally.",
					"extra": "This breakthrough had profound social and cultural impacts, giving women unprecedented control over reproductive health."
				},
				"image": "images/inventions/north_america/mexico/birth_control_pill.webp"
			},
			{
				"name": "Tridilosa (Structural Engineering System)",
				"inventor": "Heberto Castillo",
				"year": "1966",
				"information": {
					"general": "A lightweight and strong construction system combining concrete and steel for large-span structures.",
					"description": "Tridilosa uses a 3D lattice structure to reduce material usage while maintaining high load-bearing capacity.",
					"extra": "This innovation allowed Mexico to build taller, lighter, and more economical buildings, influencing modern architectural design."
				},
				"image": "images/inventions/north_america/mexico/tridilosa.webp"
			}
		]
	},
	{
		"country": "Brazil",
		"inventions": [
			{
				"name": "Airplane Taxiing System",
				"inventor": "Alberto Santos-Dumont",
				"year": "c. 1906",
				"information": {
					"general": "Around 1906, Santos-Dumont developed early systems for controlled airplane taxiing and flight.",
					"description": "He designed wheels, steering, and lightweight structures to safely move and take off small aircraft.",
					"extra": "Inspired by observation of birds and experiments in Paris, he demonstrated practical flight to astonished crowds."
				},
				"image": "images/inventions/south_america/brazil/airplane_taxiing.webp"
			},
			{
				"name": "Superflexible Fiber Optics",
				"inventor": "José Mauro Pinheiro",
				"year": "1990s",
				"information": {
					"general": "Brazilian physicist José Mauro Pinheiro helped develop ultra-flexible fiber-optic strands that improved telecommunication durability.",
					"description": "The fibers used modified polymer coatings allowing extreme bending without signal loss, ideal for dense urban cable layouts.",
					"extra": "The technology was later used in submarine cables and satellite communication infrastructures across Latin America."
				},
				"image": "images/inventions/south_america/brazil/fiber_optics.webp"
			},
			{
				"name": "Direct-Recording Electronic Voting Machine",
				"inventor": "Brazilian Superior Electoral Court (TSE) Engineering Team",
				"year": "1996",
				"information": {
					"general": "In 1996, Brazilian engineers created one of the world's first national-scale electronic voting machines.",
					"description": "The device digitized ballots, reduced counting time from days to minutes, and incorporated validation features that cut down election errors.",
					"extra": "Brazil became a global pioneer in electronic voting. Many countries later modeled their systems after Brazil's design."
				},
				"image": "images/inventions/south_america/brazil/voting_machine.webp"
			}
		]
	},
	{
		"country": "Argentina",
		"inventions": [
			{
				"name": "Artificial Heart (early prototype)",
				"inventor": "Argentine medical team",
				"year": "1969",
				"information": {
					"general": "In 1969, Argentine researchers built early artificial heart prototypes for patients with severe heart disease.",
					"description": "Made from metal and plastic, the devices pumped blood temporarily while patients awaited transplants.",
					"extra": "Their iterative testing in labs and with animals paved the way for modern artificial heart technology."
				},
				"image": "images/inventions/south_america/argentina/artificial_heart.webp"
			},
			{
				"name": "Ballpoint Pen",
				"inventor": "László Bíró",
				"year": "1943",
				"information": {
					"general": "The modern ballpoint pen was developed and patented in Argentina by László Bíró and his brother György.",
					"description": "Using a tiny rotating ball in the tip to evenly dispense ink, it became a reliable and convenient writing instrument worldwide.",
					"extra": "Bíró's design replaced fountain pens in many applications and is still used globally today."
				},
				"image": "images/inventions/south_america/argentina/ballpoint_pen.webp"
			}
		]
	},
	{
		"country": "China",
		"inventions": [
			{
				"name": "Paper",
				"inventor": "Cai Lun",
				"year": "105",
				"information": {
					"general": "In 105 AD, Cai Lun refined papermaking to produce affordable sheets from mulberry bark, hemp, and rags.",
					"description": "He mashed, pressed, and dried fibers into smooth sheets suitable for writing and recording ideas.",
					"extra": "His experiments standardized a process that spread across China and later the world, enabling literature and bureaucracy to flourish."
				},
				"image": "images/inventions/asia/china/paper.webp"
			},
			{
				"name": "Gunpowder",
				"inventor": "Chinese Alchemists",
				"year": "9th Century CE",
				"information": {
					"general": "An explosive mixture initially discovered while seeking an elixir of immortality.",
					"description": "Used first for fireworks and later adapted for military applications, gunpowder transformed warfare globally.",
					"extra": "Its invention laid the foundation for cannons, firearms, and modern explosives."
				},
				"image": "images/inventions/asia/china/gunpowder.webp"
			},
			{
				"name": "Compass",
				"inventor": "Ancient Chinese Engineers",
				"year": "Han Dynasty, 2nd century BCE",
				"information": {
					"general": "A navigational instrument that shows direction relative to the Earth's magnetic poles.",
					"description": "The Chinese first used lodestone (magnetized mineral) to create a simple directional compass for navigation and geomancy.",
					"extra": "The compass later became a crucial tool for maritime exploration globally."
				},
				"image": "images/inventions/asia/china/compass.webp"
			}
		]
	},
	{
		"country": "Japan",
		"inventions": [
			{
				"name": "Blue LED",
				"inventor": "Shuji Nakamura",
				"year": "1993",
				"information": {
					"general": "In 1993, Shuji Nakamura created the blue LED, completing the trio for white light sources.",
					"description": "He used semiconductor materials like gallium nitride to produce energy-efficient blue light for displays and lighting.",
					"extra": "After countless lab trials, his breakthrough earned a Nobel Prize and revolutionized electronics globally."
				},
				"image": "images/inventions/asia/japan/blue_led.webp"
			},
			{
				"name": "Compact Disc (CD)",
				"inventor": "Kees Schouhamer Immink & Toshitada Doi (Sony/Philips collaboration)",
				"year": "1982",
				"information": {
					"general": "An optical disc used to store digital data, originally for audio storage.",
					"description": "Japanese engineers helped develop the CD standard and manufacturing technology, making digital audio widely accessible.",
					"extra": "CDs revolutionized music distribution and data storage, laying the groundwork for DVDs and Blu-rays."
				},
				"image": "images/inventions/asia/japan/compact_disc.webp"
			},
			{
				"name": "Game Boy",
				"inventor": "Gunpei Yokoi",
				"year": "1989",
				"information": {
					"general": "A handheld gaming console that popularized portable video gaming worldwide.",
					"description": "Gunpei Yokoi designed a compact, durable device with interchangeable game cartridges, making gaming accessible anywhere.",
					"extra": "The Game Boy's success led to a long-running line of Nintendo handheld consoles and inspired the entire portable gaming industry."
				},
				"image": "images/inventions/asia/japan/game_boy.webp"
			}
		]
	},
	{
		"country": "South Korea",
		"inventions": [
			{
				"name": "Kimchi Refrigerator",
				"inventor": "Kim Jae-kyung / South Korean engineers",
				"year": "1995",
				"information": {
					"general": "A specialized refrigerator designed to store kimchi at ideal temperatures and humidity levels to preserve flavor and fermentation.",
					"description": "Unlike standard refrigerators, Kimchi refrigerators maintain a stable, slightly colder environment with precise humidity control, preventing over-fermentation while keeping kimchi fresh for months.",
					"extra": "This invention became extremely popular in South Korean households and has been exported globally to cater to Korean cuisine enthusiasts."
				},
				"image": "images/inventions/asia/south_korea/kimchi_refrigerator.webp"
			},
			{
				"name": "Banana Milk",
				"inventor": "Seoul Milk Co.",
				"year": "1974",
				"information": {
					"general": "A flavored milk beverage that became a cultural staple in South Korea.",
					"description": "Seoul Milk invented this banana-flavored milk, which became extremely popular and widely consumed in schools and households.",
					"extra": "Banana milk is now an iconic South Korean drink, often exported and referenced in Korean pop culture."
				},
				"image": "images/inventions/asia/south_korea/banana_milk.webp"
			},
			{
				"name": "Hangul (Korean Alphabet)",
				"inventor": "King Sejong the Great",
				"year": "1443",
				"information": {
					"general": "The Korean writing system, designed to be easy to learn and use.",
					"description": "Hangul was created to improve literacy in Korea. Its systematic phonetic design allows almost anyone to read and write Korean quickly.",
					"extra": "Hangul is celebrated every year on Hangul Day (October 9 in South Korea) and is considered one of the most scientific writing systems in the world."
				},
				"image": "images/inventions/asia/south_korea/hangul.webp"
			}
		]
	},
	{
		"country": "Egypt",
		"inventions": [
			{
				"name": "Paper (Papyrus)",
				"inventor": "Ancient Egyptians",
				"year": "c. 3000 BC",
				"information": {
					"general": "Around 3000 BC, Egyptians created papyrus sheets from the papyrus plant.",
					"description": "They layered and pressed plant fibers to make durable writing surfaces for record-keeping and art.",
					"extra": "This method spread across the Mediterranean, supporting administration and culture for centuries."
				},
				"image": "images/inventions/africa/egypt/papyrus.webp"
			},
			{
				"name": "Solar Calendar",
				"inventor": "Ancient Egyptians",
				"year": "c. 2700 BC",
				"information": {
					"general": "Egyptians developed a 365-day solar calendar to track the agricultural year.",
					"description": "It divided the year into 12 months of 30 days each, plus 5 extra days, helping plan farming and religious events.",
					"extra": "This calendar was one of the earliest accurate solar calendars, influencing later timekeeping systems."
				},
				"image": "images/inventions/africa/egypt/solar_calendar.webp"
			},
			{
				"name": "Hieroglyphic Writing",
				"inventor": "Ancient Egyptians",
				"year": "c. 3200 BC",
				"information": {
					"general": "Hieroglyphics were a complex system of pictorial writing used for formal inscriptions.",
					"description": "It combined logographic and alphabetic elements, carved on monuments, tombs, and papyrus.",
					"extra": "Hieroglyphs preserved Egyptian history and culture for millennia and influenced early scripts in the region."
				},
				"image": "images/inventions/africa/egypt/hieroglyphs.webp"
			}
		]
	},
	{
		"country": "South Africa",
		"inventions": [
			{
				"name": "Kreepy Krauly (automatic pool cleaner)",
				"inventor": "F. W. L. de Jager",
				"year": "1974",
				"information": {
					"general": "In 1974, de Jager built the Kreepy Krauly to clean pools automatically.",
					"description": "Using water flow, it moves and vacuums debris without manual effort.",
					"extra": "His clever use of basic hydraulics made pool maintenance easy worldwide."
				},
				"image": "images/inventions/africa/south_africa//home/ciirche/Downloads/kreepy_krauly.webp.webp"
			},
			{
				"name": "CAT Scan Contributions",
				"inventor": "Allan Cormack",
				"year": "1972",
				"information": {
					"general": "Cormack, working in South Africa, co-developed mathematical algorithms behind CT scanning.",
					"description": "These algorithms allowed 3D images from multiple X-ray scans.",
					"extra": "He later shared the Nobel Prize in Physiology or Medicine for this work, revolutionizing medical imaging."
				},
				"image": "images/inventions/africa/south_africa/cat_scan.webp"
			},
			{
				"name": "Braai Grid (Portable Barbecue Grid)",
				"inventor": "South African Innovators",
				"year": "1970s",
				"information": {
					"general": "A portable barbecue grid designed to make outdoor cooking easier and more social.",
					"description": "It allows meat, vegetables, and other foods to be grilled evenly over open flames or coals, perfect for the famous South African braai.",
					"extra": "The braai culture is a beloved social tradition in South Africa, and this invention helped make it portable and accessible for gatherings anywhere."
				},
				"image": "images/inventions/africa/south_africa/braai_grid.webp"
			}
		]
	},
	{
		"country": "Nigeria",
		"inventions": [
			{
				"name": "Nigerian Drums (Talking Drum Innovation)",
				"inventor": "Traditional Makers",
				"year": "c. 600 AD",
				"information": {
					"general": "Around 600 AD, Nigerian artisans created the talking drum to mimic speech and send messages.",
					"description": "Adjustable strings and tension allow pitch changes, letting drums 'talk' across distances.",
					"extra": "This innovation influenced music and communication across West Africa for centuries."
				},
				"image": "images/inventions/africa/nigeria/talking_drum.webp"
			},
			{
				"name": "Aso Oke Weaving Techniques",
				"inventor": "Yoruba Artisans",
				"year": "c. 1200 AD",
				"information": {
					"general": "Advanced traditional textile weaving creating richly patterned fabrics.",
					"description": "Used on looms with precise techniques for ceremonial clothing and art.",
					"extra": "Aso Oke remains a cultural symbol and influences modern textile design."
				},
				"image": "images/inventions/africa/nigeria/aso_oke.webp"
			}
		]
	},
	{
		"country": "Kenya",
		"inventions": [
			{
				"name": "Paper from Sisal Plant",
				"inventor": "Kenyan Innovators",
				"year": "1970s",
				"information": {
					"general": "In the 1970s, Kenyan innovators made paper from sisal plant fibers to reduce costs.",
					"description": "They pulped, pressed, and dried fibers into sheets for school and community use.",
					"extra": "This creative use of local materials supported education and small businesses."
				},
				"image": "images/inventions/africa/kenya/sisal_paper.webp"
			}
		]
	},
	{
		"country": "Morocco",
		"inventions": [
			{
				"name": "Tadelakt Plaster",
				"inventor": "Moroccan Artisans",
				"year": "c. 900 AD",
				"information": {
					"general": "Around 900 AD, Moroccan artisans developed tadelakt, a polished waterproof plaster.",
					"description": "They used lime, natural pigments, and olive soap to create durable, glossy surfaces for baths and walls.",
					"extra": "The technique spread through North Africa and is still used in decorative architecture today."
				},
				"image": "images/inventions/africa/morocco/tadelakt.webp"
			}
		]
	},
	{
		"country": "Australia",
		"inventions": [
			{
				"name": "Black Box Flight Recorder",
				"inventor": "Dr. David Warren",
				"year": "1958",
				"information": {
					"general": "In 1958, Dr. David Warren invented the black box to analyze airplane crashes.",
					"description": "Encased in durable metal, it records cockpit audio and flight data for later investigation.",
					"extra": "His tests and prototypes ensured planes worldwide became safer through flight data analysis."
				},
				"image": "images/inventions/oceania/australia/black_box.webp"
			}
		]
	},
	{
		"country": "New Zealand",
		"inventions": [
			{
				"name": "Disposable Syringe",
				"inventor": "Colin Murdoch",
				"year": "1956",
				"information": {
					"general": "In 1956, Colin Murdoch invented the disposable syringe to reduce infections.",
					"description": "Made from plastic and rubber, it is pre-sterilized and safe for single use.",
					"extra": "His invention quickly became a global medical standard, saving countless lives."
				},
				"image": "images/inventions/oceania/new_zealand/disposable_syringe.webp"
			}
		]
	},
	{
		"country": "Fiji",
		"inventions": [
			{
				"name": "Traditional Canoe Designs",
				"inventor": "Fijian Artisans",
				"year": "ancient",
				"information": {
					"general": "Fijian artisans designed canoes capable of long ocean voyages.",
					"description": "Using carved wood and lashings, the hulls were fast, stable, and seaworthy.",
					"extra": "These designs supported fishing, trade, and migration, influencing Pacific navigation."
				},
				"image": "images/inventions/oceania/fiji/canoe.webp"
			}
		]
	},
	{
		"country": "Papua New Guinea",
		"inventions": [
			{
				"name": "Bilum (string bags)",
				"inventor": "Papua New Guinea Communities",
				"year": "ancient",
				"information": {
					"general": "Papua New Guinea communities made bilum, strong handwoven string bags.",
					"description": "Fibers are looped and knotted into flexible, durable nets for carrying food, goods, and even babies.",
					"extra": "Bilum remains a cultural symbol and is now appreciated internationally for its craftsmanship."
				},
				"image": "images/inventions/oceania/papua_new_guinea/bilum.webp"
			}
		]
	},
	{
		"country": "Samoa",
		"inventions": [
			{
				"name": "Tattooing Techniques",
				"inventor": "Samoan Communities",
				"year": "ancient",
				"information": {
					"general": "Samoan communities developed intricate tattoos as symbols of identity and status.",
					"description": "Using comb-like tools and ink from soot, designs are tapped into the skin with precision.",
					"extra": "These techniques influenced Polynesian art and remain an important cultural tradition."
				},
				"image": "images/inventions/oceania/samoa/tattoo.webp"
			}
		]
	},
	{
		"country": "Vietnam",
		"inventions": [
			{
				"name": "Water Puppet Theater",
				"inventor": "Vietnamese Folk Artists",
				"year": "11th Century",
				"information": {
					"general": "Water puppetry is a traditional Vietnamese art form where puppets perform on water instead of a stage.",
					"description": "Puppeteers stand behind a screen and control the wooden puppets using long rods hidden under the water.",
					"extra": "It was originally used to entertain villagers and convey folklore, and it remains a symbol of Vietnamese cultural heritage."
				},
				"image": "images/inventions/asia/vietnam/water_puppet_theater.webp"
			},
			{
				"name": "Rice Paper",
				"inventor": "Vietnamese Artisans",
				"year": "Ancient Times",
				"information": {
					"general": "Rice paper is a thin, edible paper made from rice flour, traditionally used in rolls and wrappers.",
					"description": "The rice flour is mixed with water, spread thin, steamed, and dried to produce flexible sheets.",
					"extra": "Rice paper has influenced culinary techniques worldwide, especially in Southeast Asian cuisine."
				},
				"image": "images/inventions/asia/vietnam/rice_paper.webp"
			}
		]
	},
	{
		"country": "Turkey",
		"inventions": [
			{
				"name": "Tulip Cultivation",
				"inventor": "Turkish Gardeners",
				"year": "16th Century",
				"information": {
					"general": "Turkish gardeners refined tulip cultivation, creating spectacular gardens and festivals.",
					"description": "They selectively bred tulip bulbs for color, shape, and pattern, influencing horticulture and inspiring tulip mania in Europe.",
					"extra": "While tulips existed elsewhere, Turkey's systematic cultivation and decorative use were pioneering."
				},
				"image": "images/inventions/europe/turkey/tulip.webp"
			},
			{
				"name": "Hittite Chariot",
				"inventor": "Hittite Engineers",
				"year": "1600 BCE",
				"information": {
					"general": "The Hittites, ancient Anatolian people, developed a light, fast chariot used in warfare.",
					"description": "Their chariot design allowed greater maneuverability and speed on the battlefield, revolutionizing ancient military tactics.",
					"extra": "This design influenced later civilizations' chariots across the Near East."
				},
				"image": "images/inventions/europe/turkey/hittite_chariot.webp"
			},
			{
				"name": "Iznik Pottery",
				"inventor": "Turkish Artisans",
				"year": "15th Century",
				"information": {
					"general": "Iznik pottery is a form of fine ceramic decorated with intricate designs and vivid colors.",
					"description": "Artisans perfected glazing and painting techniques to produce high-quality bowls, tiles, and plates.",
					"extra": "Iznik ceramics became a hallmark of Turkish art and influenced European ceramic production."
				},
				"image": "images/inventions/europe/turkey/iznik_pottery.webp"
			}
		]
	},
	{
		"country": "Iran",
		"inventions": [
			{
				"name": "Baghdad Battery",
				"inventor": "Parthian / Persian Civilization",
				"year": "c. 200 BCE",
				"information": {
					"general": "An ancient device believed to be one of the world's first attempts at generating electricity.",
					"description": "It was made using a clay jar, a rolled copper cylinder, and an iron rod sealed with bitumen. When filled with an acidic liquid like vinegar or lemon juice, the components reacted to create a small electrical charge.",
					"extra": "While its true purpose is still debated, many researchers believe it may have been used for electroplating jewelry with precious metals — hinting at an advanced understanding of early chemistry and electricity."
				},
				"image": "images/inventions/asia/iran/baghdad_battery.webp"
			},
			{
				"name": "Backgammon",
				"inventor": "Ancient Persians",
				"year": "c. 3000 BCE",
				"information": {
					"general": "One of the oldest known strategy board games in human history.",
					"description": "Using a wooden board, carved pieces and dice made from bone or stone, players raced and captured pieces using a mix of probability and skill. The design created endless variations of play and strategy.",
					"extra": "Backgammon spread across the Middle East, into Europe, and eventually around the world. Thousands of years later, the core gameplay remains almost unchanged."
				},
				"image": "images/inventions/asia/iran/backgammon.webp"
			},
			{
				"name": "Yakhchal (Ancient Ice House)",
				"inventor": "Persian Engineers",
				"year": "c. 400 BCE",
				"information": {
					"general": "A massive ancient refrigerator built in the middle of desert landscapes.",
					"description": "The conical structure was made from a special mortar that resisted heat. Underground chambers, thick walls, and wind-catchers kept ice frozen even in extreme summer temperatures.",
					"extra": "Ice was transported from nearby mountains in winter and stored year-round. These structures inspired modern refrigeration and passive cooling architecture."
				},
				"image": "images/inventions/asia/iran/yakhchal.webp"
			}
		]
	},
	{
		"country": "India",
		"inventions": [
			{
				"name": "Zero (Numeric Symbol)",
				"inventor": "Indian Mathematicians",
				"year": "c. 500 CE",
				"information": {
					"general": "The first civilization to use zero as both a number and a symbol.",
					"description": "Indian scholars formalized zero to represent 'nothingness' in mathematics. This allowed for the powerful place-value system used today in arithmetic, algebra, geometry and computing.",
					"extra": "Without zero, modern physics, engineering, and digital technology would not exist. It is one of the most influential inventions in history."
				},
				"image": "images/inventions/asia/india/zero.webp"
			},
			{
				"name": "Chess (Chaturanga)",
				"inventor": "Indian Game Designers",
				"year": "c. 600 CE",
				"information": {
					"general": "The original version of modern chess was created in India.",
					"description": "The game was based on real military units: infantry, cavalry, elephants, and chariots. Played on an 8×8 board, it trained strategic thinking and battle planning.",
					"extra": "As it travelled to Persia and Europe, the pieces evolved into the modern queen, bishop, and knight — turning it into the global game of chess we know today."
				},
				"image": "images/inventions/asia/india/chaturanga.webp"
			},
			{
				"name": "Stepwells",
				"inventor": "Ancient Indian Builders",
				"year": "c. 3000 BCE",
				"information": {
					"general": "Architectural wells designed to access underground water during dry seasons.",
					"description": "These massive structures contained hundreds of steps leading down to water, with platforms, temples and carved stone walls. They were both functional water sources and artistic masterpieces.",
					"extra": "Some stepwells descend more than ten stories underground and remain standing today as examples of advanced ancient engineering and climate-resilient design."
				},
				"image": "images/inventions/asia/india/stepwell.webp"
			}
		]
	},
	{
		"country": "Pakistan",
		"inventions": [
			{
				"name": "Buttons",
				"inventor": "Indus Valley Civilization",
				"year": "c. 2000 BCE",
				"information": {
					"general": "Some of the world's first known buttons were created in the Indus Valley.",
					"description": "Carved from seashells and drilled with holes, early buttons were sewn onto clothing — both as decoration and as fasteners.",
					"extra": "This simple invention eventually transformed global fashion, leading to coats, uniforms, shirts and modern garments."
				},
				"image": "images/inventions/asia/pakistan/buttons.webp"
			},
			{
				"name": "Precision Measuring Rulers",
				"inventor": "Indus Valley Engineers",
				"year": "c. 2500 BCE",
				"information": {
					"general": "Among the most accurate measuring tools of the ancient world.",
					"description": "These rulers were crafted from ivory and divided into extremely small, consistent units — rivaling the precision of modern tools.",
					"extra": "They allowed the cities of Harappa and Mohenjo-Daro to be built in perfect grid systems with remarkably advanced urban planning."
				},
				"image": "images/inventions/asia/pakistan/ivory_ruler.webp"
			}
		]
	},
	{
		"country": "Philippines",
		"inventions": [
			{
				"name": "Jeepney",
				"inventor": "Filipino Mechanics",
				"year": "1940s",
				"information": {
					"general": "A fully customized public transport vehicle created from war surplus.",
					"description": "After World War II, abandoned U.S. military jeeps were extended, decorated with bright colors, and fitted with side benches to carry many passengers.",
					"extra": "The Jeepney became both an affordable transport solution and a powerful national symbol of Filipino creativity and resilience."
				},
				"image": "images/inventions/asia/philippines/jeepney.webp"
			},
			{
				"name": "Banana Ketchup",
				"inventor": "Maria Orosa",
				"year": "1942",
				"information": {
					"general": "A bright red ketchup made without tomatoes.",
					"description": "During wartime tomato shortages, bananas were mashed and blended with vinegar, sugar, and spices, then dyed red to resemble ketchup.",
					"extra": "Today, banana ketchup is a Filipino staple, used in dishes like spaghetti, fried chicken, and barbecue."
				},
				"image": "images/inventions/asia/philippines/banana_ketchup.webp"
			},
			{
				"name": "Bangka (Filipino Canoe)",
				"inventor": "Ancient Filipino Boatmakers",
				"year": "c. 1500s",
				"information": {
					"general": "The bangka is a traditional Filipino outrigger canoe used for fishing, transport, and trade.",
					"description": "Handcrafted from wood and often fitted with bamboo outriggers for stability, these boats are lightweight, durable, and designed for navigating rivers and coastal waters.",
					"extra": "Bangka remain a vital part of Filipino life today, reflecting centuries of maritime skill and tangible craftsmanship."
				},
				"image": "images/inventions/asia/philippines/bangka.webp"
			}
		]
	},
	{
		"country": "Peru",
		"inventions": [
			{
				"name": "Quipu Digital Archive",
				"inventor": "Pontifical Catholic University of Peru (PUCP) Team",
				"year": "2000s",
				"information": {
					"general": "In the 2000s, Peruvian researchers digitized ancient quipu knots to preserve Inca accounting and communication methods.",
					"description": "Using high-resolution scanning and data modeling, they translated knot patterns into digital databases to study historical trade and census records.",
					"extra": "This effort made quipu accessible to global scholars and influenced modern information-encoding techniques inspired by traditional systems."
				},
				"image": "images/inventions/south_america/peru/quipu_digital.webp"
			},
			{
				"name": "Potato Preservation System",
				"inventor": "Instituto Nacional de Innovación Agraria (INIA)",
				"year": "1990s",
				"information": {
					"general": "Peruvian agricultural engineers developed a low-temperature and humidity-controlled storage system for potatoes, reducing post-harvest losses.",
					"description": "The system allows potatoes to be stored for months without sprouting or rotting, supporting both domestic supply and export markets.",
					"extra": "Given Peru's status as the origin of potatoes, this invention significantly increased food security and agricultural efficiency nationwide."
				},
				"image": "images/inventions/south_america/peru/potato_storage.webp"
			},
			{
				"name": "Pukio Irrigation Machine",
				"inventor": "Andean Agricultural Engineering Teams",
				"year": "2010s",
				"information": {
					"general": "In the 2010s, Peruvian engineers modernized the traditional Pukio system, creating a machine that efficiently lifts and channels water for agriculture.",
					"description": "The device combines ancient Inca hydraulic knowledge with modern mechanical pumps, enabling consistent water flow to terraced fields while reducing manual labor.",
					"extra": "The Pukio machine preserves traditional Andean irrigation methods while supporting sustainable farming and increasing crop yields in mountainous regions."
				},
				"image": "images/inventions/south_america/peru/pukio_machine.webp"
			}
		]
	},
	{
		"country": "Venezuela",
		"inventions": [
			{
				"name": "Canaima Educational Operating System",
				"inventor": "Centro Nacional de Tecnologías de Información (CNTI)",
				"year": "2009",
				"information": {
					"general": "In 2009, Venezuelan software engineers created Canaima, a Linux-based OS designed for widespread educational use.",
					"description": "Built on Debian, it offers lightweight performance for low-cost laptops. Its clean interface, offline-friendly tools, and open-source structure made it ideal for classrooms with limited connectivity.",
					"extra": "Canaima was installed in more than 7 million 'Canaimitas' laptops distributed to students nationwide. It remains one of Latin America's largest open-source educational tech initiatives."
				},
				"image": "images/inventions/south_america/venezuela/canaima_os.webp"
			},
			{
				"name": "Modern Arepa Maker (TostyArepa)",
				"inventor": "Carlos R. Soto",
				"year": "1970s",
				"information": {
					"general": "In the 1970s, Venezuelan engineer Carlos Soto created the first electric arepa maker, known today as the TostyArepa.",
					"description": "The appliance presses and heats corn dough evenly between two metal plates, producing perfectly shaped arepas in minutes.",
					"extra": "The TostyArepa became a household staple in Venezuela and among diaspora communities, shaping how arepas are prepared worldwide."
				},
				"image": "images/inventions/south_america/venezuela/tostyarepa.webp"
			}
		]
	},
	{
		"country": "Ecuador",
		"inventions": [
			{
				"name": "Panela Vacuum Evaporation System",
				"inventor": "Luis Alberto Armendáriz",
				"year": "1980s",
				"information": {
					"general": "In the 1980s, Ecuadorian engineer Luis Armendáriz developed a vacuum-based evaporation system to modernize the production of panela (unrefined cane sugar).",
					"description": "The system reduces boiling temperature, allowing sugarcane juice to concentrate without burning, improving both quality and production speed. It became important for small Andean producers.",
					"extra": "Armendáriz's design increased energy efficiency and created more consistent panela blocks, influencing sugarcane processing across South America."
				},
				"image": "images/inventions/south_america/ecuador/panela_system.webp"
			},
			{
				"name": "Ecuavóley Net System",
				"inventor": "Quito Sports Innovators Group",
				"year": "1950s",
				"information": {
					"general": "In the 1950s, local athletes in Quito standardized the modern net and ball system for Ecuavóley, Ecuador's unique three-player version of volleyball.",
					"description": "The system involved a higher net, a specific ball weight, and reinforced court posts, giving the sport its signature fast, powerful style.",
					"extra": "Ecuavóley later spread to Colombia, Peru, and migrant communities in the U.S. and Spain. Ecuador's standardized equipment remains the sport's global reference."
				},
				"image": "images/inventions/south_america/ecuador/ecuavoley.webp"
			}
		]
	},
	{
		"country": "Bolivia",
		"inventions": [
			{
				"name": "Solar-Powered Salt Harvesting System",
				"inventor": "Andean Engineering Team",
				"year": "1990s",
				"information": {
					"general": "In the 1990s, Bolivian engineers developed solar-powered systems to improve salt extraction in the Salar de Uyuni region.",
					"description": "The system uses solar energy to evaporate brine efficiently, increasing salt and lithium yields while reducing labor and fuel costs.",
					"extra": "This innovation influenced renewable-energy-based extraction techniques across South America, supporting lithium mining for batteries."
				},
				"image": "images/inventions/south_america/bolivia/solar_salt.webp"
			},
			{
				"name": "Chirimoya Juice Pasteurizer",
				"inventor": "Luis Fernando Quispe",
				"year": "1980s",
				"information": {
					"general": "In the 1980s, Bolivian engineer Luis Quispe designed a small-scale pasteurization system for tropical fruits like chirimoya and guava.",
					"description": "The device uses low-temperature pasteurization to preserve nutrients and extend shelf life, enabling local farmers to export juices safely.",
					"extra": "It became widely used in Cochabamba and Santa Cruz, increasing income for small farmers and supporting Ecuadorian and Brazilian fruit trade connections."
				},
				"image": "images/inventions/south_america/bolivia/chirimoya_pasteurizer.webp"
			},
			{
				"name": "High-Altitude Medical Oxygen Device",
				"inventor": "Cochabamba Medical Team",
				"year": "2000s",
				"information": {
					"general": "In the early 2000s, a Bolivian medical team developed portable oxygen devices specifically optimized for high-altitude cities like La Paz.",
					"description": "The devices regulate oxygen delivery under thin-air conditions, improving patient survival and comfort in hospitals and homes at 3,500 meters above sea level.",
					"extra": "This innovation has become a model for high-altitude medical care in Andean countries."
				},
				"image": "images/inventions/south_america/bolivia/high_altitude_oxygen.webp"
			}
		]
	}
]