[
	{
		"country": "Norway",
		"inventions": [
			{
				"name": "Cheese Slicer",
				"inventor": "Thor Bjørklund",
				"year": "1925",
				"information": {
					"general": "In 1925, Thor Bjørklund designed the cheese slicer to make even, thin slices of cheese effortlessly.",
					"description": "He crafted it from wood and steel, with a wire stretched across a flat blade. It glides through semi-hard cheeses like Edam or brunost, turning a tedious task into a quick, precise motion.",
					"extra": "Bjørklund's inspiration came from the carpenter's plane he used in his workshop. He also experimented with a butter slicer, which failed, but his cheese slicer became a European and Brazilian kitchen classic."
				},
				"image": "images/europe/norway/cheese_slicer.webp"
			},
			{
				"name": "Paper Clip",
				"inventor": "Johan Vaaler",
				"year": "1899",
				"information": {
					"general": "In 1899, Johan Vaaler invented the paper clip to hold sheets together neatly without damaging them.",
					"description": "Made from bent wire, it creates tension that keeps papers aligned. Vaaler's design was simple yet ingeniously effective.",
					"extra": "The idea reportedly came from the need to manage documents in offices efficiently. Later refinements improved durability, and today it's a ubiquitous office tool worldwide."
				},
				"image": "images/europe/norway/paper_clip.webp"
			},
			{
				"name": "Clip-on Ski Binding",
				"inventor": "Bruno R. Linge",
				"year": "1920s",
				"information": {
					"general": "In the 1920s, Bruno Linge developed the first clip-on ski binding to improve skiing safety.",
					"description": "Constructed from metal and leather, the binding securely fastens boots to skis, offering control while reducing the risk of falls.",
					"extra": "Linge was inspired by the growing popularity of skiing in Norway. His invention influenced modern ski bindings and made the sport more accessible and safer."
				},
				"image": "images/europe/norway/ski_binding.webp"
			}
		]
	},
	{
		"country": "Italy",
		"inventions": [
			{
				"name": "Piano",
				"inventor": "Bartolomeo Cristofori",
				"year": "c. 1700",
				"information": {
					"general": "Around 1700, Bartolomeo Cristofori created the piano to allow musicians to play both soft and loud notes.",
					"description": "He engineered hammers to strike strings, giving the keyboard expressive power. Cristofori's use of hardwood, metal strings, and precise mechanics produced rich tones and dynamic range.",
					"extra": "Inspired by the limitations of the harpsichord, he experimented with action mechanisms over decades. His designs evolved into the grand and upright pianos that define modern music halls and home instruments."
				},
				"image": "images/europe/italy/piano.webp"
			},
			{
				"name": "Eyeglasses",
				"inventor": "Salvino D'Armate",
				"year": "c. 1280",
				"information": {
					"general": "Salvino D'Armate is credited with making the first wearable eyeglasses in Italy around 1280.",
					"description": "Using convex lenses set in wood or metal frames balanced on the nose, these early spectacles improved vision for reading and work.",
					"extra": "The inspiration likely came from monks and scholars needing to read manuscripts. Over centuries, frame and lens materials advanced, spreading eyeglasses across Europe and evolving into countless modern designs."
				},
				"image": "images/europe/italy/eyeglasses.webp"
			},
			{
				"name": "Pasta Machine",
				"inventor": "Angelo Vitantonio",
				"year": "1800s",
				"information": {
					"general": "In the 19th century, Angelo Vitantonio built a mechanized pasta machine to streamline pasta preparation.",
					"description": "Made with metal rollers and cutting blades, it produces even pasta sheets quickly. The machine saves hours of labor compared to hand-rolling dough.",
					"extra": "Inspired by Italy's love for fresh pasta, Vitantonio refined his design through trial and error. His invention spread widely, laying the foundation for modern pasta machines used in kitchens worldwide."
				},
				"image": "images/europe/italy/pasta_machine.webp"
			}
		]
	},
	{
		"country": "Germany",
		"inventions": [
			{
				"name": "Printing Press",
				"inventor": "Johannes Gutenberg",
				"year": "1440s",
				"information": {
					"general": "In the 1440s, Johannes Gutenberg of Germany invented the movable type printing press. He aimed to make book production faster and more affordable.",
					"description": "The printing press allowed mass production of books, spreading knowledge, ideas, and literacy across Europe. Before it, books had to be copied by hand, which was slow and expensive.",
					"extra": "Gutenberg's invention changed the world, enabling the Renaissance, Reformation, and scientific revolution by making ideas accessible to many people for the first time."
				},
				"image": "images/europe/germany/printing_press.webp"
			}
		]
	},
	{
		"country": "United Kingdom",
		"inventions": [
			{
				"name": "Steam Engine",
				"inventor": "James Watt",
				"year": "1765",
				"information": {
					"general": "In 1765, Scottish engineer James Watt improved the steam engine to make it more efficient and practical for industry.",
					"description": "The steam engine powered machines, trains, and ships, changing how goods were made and transported. It fueled the Industrial Revolution across Britain and the world.",
					"extra": "Watt's enhancements allowed engines to use less fuel and generate more power. His work helped industries grow rapidly and shaped modern economies."
				},
				"image": "images/europe/uk/steam_engine.webp"
			}
		]
	},
	{
		"country": "France",
		"inventions": [
			{
				"name": "Hot Air Balloon",
				"inventor": "Montgolfier Brothers",
				"year": "1783",
				"information": {
					"general": "In 1783, the Montgolfier brothers in France launched the first successful hot air balloon, marking humanity's first flight.",
					"description": "The balloon lifted people and objects into the air using heated air. It inspired fascination with flight and exploration of the skies.",
					"extra": "The Montgolfiers experimented with different materials and sizes, eventually carrying passengers safely. Ballooning became a popular spectacle in Europe and laid groundwork for aviation."
				},
				"image": "images/europe/france/hot_air_balloon.webp"
			}
		]
	},
	{
		"country": "USA",
		"inventions": [
			{
				"name": "Telephone",
				"inventor": "Alexander Graham Bell",
				"year": "1876",
				"information": {
					"general": "In 1876, Alexander Graham Bell invented the telephone to transmit voice over long distances.",
					"description": "Using wires, a diaphragm, and electromagnetic coils, it converted sound into electrical signals for instant communication.",
					"extra": "Inspired by his work on hearing devices, Bell experimented tirelessly with circuits until the first call rang through."
				},
				"image": "images/north_america/usa/telephone.webp"
			}
		]
	},
	{
		"country": "Canada",
		"inventions": [
			{
				"name": "Insulin",
				"inventor": "Frederick Banting and Charles Best",
				"year": "1921",
				"information": {
					"general": "In 1921, Banting and Best discovered insulin to treat diabetes, saving countless lives.",
					"description": "They extracted it from animal pancreases and purified it so it could regulate blood sugar safely.",
					"extra": "Their experiments combined surgical skill and chemistry, laying the foundation for modern diabetes care."
				},
				"image": "images/north_america/canada/insulin.webp"
			}
		]
	},
	{
		"country": "Mexico",
		"inventions": [
			{
				"name": "Color TV (early system)",
				"inventor": "Guillermo González Camarena",
				"year": "1940",
				"information": {
					"general": "In 1940, Camarena created an early color television system to make broadcasts more vivid.",
					"description": "His device used color wheels and filters to project images in red, green, and blue tones.",
					"extra": "He tested prototypes repeatedly at home and in studios, inspiring later global color TV standards."
				},
				"image": "images/north_america/mexico/color_tv.webp"
			}
		]
	},
	{
		"country": "Brazil",
		"inventions": [
			{
				"name": "Airplane Taxiing System",
				"inventor": "Alberto Santos-Dumont",
				"year": "c. 1906",
				"information": {
					"general": "Around 1906, Santos-Dumont developed early systems for controlled airplane taxiing and flight.",
					"description": "He designed wheels, steering, and lightweight structures to safely move and take off small aircraft.",
					"extra": "Inspired by observation of birds and experiments in Paris, he demonstrated practical flight to astonished crowds."
				},
				"image": "images/south_america/brazil/airplane_taxiing.webp"
			}
		]
	},
	{
		"country": "Argentina",
		"inventions": [
			{
				"name": "Artificial Heart (early prototype)",
				"inventor": "Argentine medical team",
				"year": "1969",
				"information": {
					"general": "In 1969, Argentine researchers built early artificial heart prototypes for patients with severe heart disease.",
					"description": "Made from metal and plastic, the devices pumped blood temporarily while patients awaited transplants.",
					"extra": "Their iterative testing in labs and with animals paved the way for modern artificial heart technology."
				},
				"image": "images/south_america/argentina/artificial_heart.webp"
			}
		]
	},
	{
		"country": "China",
		"inventions": [
			{
				"name": "Paper",
				"inventor": "Cai Lun",
				"year": "105",
				"information": {
					"general": "In 105 AD, Cai Lun refined papermaking to produce affordable sheets from mulberry bark, hemp, and rags.",
					"description": "He mashed, pressed, and dried fibers into smooth sheets suitable for writing and recording ideas.",
					"extra": "His experiments standardized a process that spread across China and later the world, enabling literature and bureaucracy to flourish."
				},
				"image": "images/asia/china/paper.webp"
			}
		]
	},
	{
		"country": "Japan",
		"inventions": [
			{
				"name": "Blue LED",
				"inventor": "Shuji Nakamura",
				"year": "1993",
				"information": {
					"general": "In 1993, Shuji Nakamura created the blue LED, completing the trio for white light sources.",
					"description": "He used semiconductor materials like gallium nitride to produce energy-efficient blue light for displays and lighting.",
					"extra": "After countless lab trials, his breakthrough earned a Nobel Prize and revolutionized electronics globally."
				},
				"image": "images/asia/japan/blue_led.webp"
			}
		]
	},
	{
		"country": "India",
		"inventions": [
			{
				"name": "Shampoo (modern formula)",
				"inventor": "K. N. Dikshit",
				"year": "early 20th century",
				"information": {
					"general": "K. N. Dikshit developed a modern shampoo formula to clean hair effectively.",
					"description": "He combined surfactants and mild chemicals for easy lather and gentle cleansing.",
					"extra": "The product spread worldwide, transforming hair care from traditional soaps to the global shampoo industry."
				},
				"image": "images/asia/india/shampoo.webp"
			}
		]
	},
	{
		"country": "South Korea",
		"inventions": [
			{
				"name": "CDMA Mobile Communication",
				"inventor": "South Korean engineers",
				"year": "1990s",
				"information": {
					"general": "In the 1990s, engineers in South Korea developed CDMA to improve mobile call capacity and quality.",
					"description": "It uses unique codes to allow many users on the same frequency without interference.",
					"extra": "Their work laid the foundation for modern mobile networks and the smartphones we rely on today."
				},
				"image": "images/asia/south_korea/cdma.webp"
			}
		]
	},
	{
		"country": "Egypt",
		"inventions": [
			{
				"name": "Paper (Papyrus)",
				"inventor": "Ancient Egyptians",
				"year": "c. 3000 BC",
				"information": {
					"general": "Around 3000 BC, Egyptians created papyrus sheets from the papyrus plant.",
					"description": "They layered and pressed plant fibers to make durable writing surfaces for record-keeping and art.",
					"extra": "This method spread across the Mediterranean, supporting administration and culture for centuries."
				},
				"image": "images/africa/egypt/papyrus.webp"
			}
		]
	},
	{
		"country": "South Africa",
		"inventions": [
			{
				"name": "Kreepy Krauly (automatic pool cleaner)",
				"inventor": "F. W. L. de Jager",
				"year": "1974",
				"information": {
					"general": "In 1974, de Jager built the Kreepy Krauly to clean pools automatically.",
					"description": "Using water flow, it moves and vacuums debris without manual effort.",
					"extra": "His clever use of basic hydraulics made pool maintenance easy worldwide."
				},
				"image": "images/africa/south_africa/kreepy_krauly.webp"
			}
		]
	},
	{
		"country": "Nigeria",
		"inventions": [
			{
				"name": "Nigerian Drums (Talking Drum Innovation)",
				"inventor": "Traditional Makers",
				"year": "c. 600 AD",
				"information": {
					"general": "Around 600 AD, Nigerian artisans created the talking drum to mimic speech and send messages.",
					"description": "Adjustable strings and tension allow pitch changes, letting drums 'talk' across distances.",
					"extra": "This innovation influenced music and communication across West Africa for centuries."
				},
				"image": "images/africa/nigeria/talking_drum.webp"
			}
		]
	},
	{
		"country": "Kenya",
		"inventions": [
			{
				"name": "Paper from Sisal Plant",
				"inventor": "Kenyan Innovators",
				"year": "1970s",
				"information": {
					"general": "In the 1970s, Kenyan innovators made paper from sisal plant fibers to reduce costs.",
					"description": "They pulped, pressed, and dried fibers into sheets for school and community use.",
					"extra": "This creative use of local materials supported education and small businesses."
				},
				"image": "images/africa/kenya/sisal_paper.webp"
			}
		]
	},
	{
		"country": "Morocco",
		"inventions": [
			{
				"name": "Tadelakt Plaster",
				"inventor": "Moroccan Artisans",
				"year": "c. 900 AD",
				"information": {
					"general": "Around 900 AD, Moroccan artisans developed tadelakt, a polished waterproof plaster.",
					"description": "They used lime, natural pigments, and olive soap to create durable, glossy surfaces for baths and walls.",
					"extra": "The technique spread through North Africa and is still used in decorative architecture today."
				},
				"image": "images/africa/morocco/tadelakt.webp"
			}
		]
	},
	{
		"country": "Australia",
		"inventions": [
			{
				"name": "Black Box Flight Recorder",
				"inventor": "Dr. David Warren",
				"year": "1958",
				"information": {
					"general": "In 1958, Dr. David Warren invented the black box to analyze airplane crashes.",
					"description": "Encased in durable metal, it records cockpit audio and flight data for later investigation.",
					"extra": "His tests and prototypes ensured planes worldwide became safer through flight data analysis."
				},
				"image": "images/oceania/australia/black_box.webp"
			}
		]
	},
	{
		"country": "New Zealand",
		"inventions": [
			{
				"name": "Disposable Syringe",
				"inventor": "Colin Murdoch",
				"year": "1956",
				"information": {
					"general": "In 1956, Colin Murdoch invented the disposable syringe to reduce infections.",
					"description": "Made from plastic and rubber, it is pre-sterilized and safe for single use.",
					"extra": "His invention quickly became a global medical standard, saving countless lives."
				},
				"image": "images/oceania/new_zealand/disposable_syringe.webp"
			}
		]
	},
	{
		"country": "Fiji",
		"inventions": [
			{
				"name": "Traditional Canoe Designs",
				"inventor": "Fijian Artisans",
				"year": "ancient",
				"information": {
					"general": "Fijian artisans designed canoes capable of long ocean voyages.",
					"description": "Using carved wood and lashings, the hulls were fast, stable, and seaworthy.",
					"extra": "These designs supported fishing, trade, and migration, influencing Pacific navigation."
				},
				"image": "images/oceania/fiji/canoe.webp"
			}
		]
	},
	{
		"country": "Papua New Guinea",
		"inventions": [
			{
				"name": "Bilum (string bags)",
				"inventor": "Papua New Guinea Communities",
				"year": "ancient",
				"information": {
					"general": "Papua New Guinea communities made bilum, strong handwoven string bags.",
					"description": "Fibers are looped and knotted into flexible, durable nets for carrying food, goods, and even babies.",
					"extra": "Bilum remains a cultural symbol and is now appreciated internationally for its craftsmanship."
				},
				"image": "images/oceania/papua_new_guinea/bilum.webp"
			}
		]
	},
	{
		"country": "Samoa",
		"inventions": [
			{
				"name": "Tattooing Techniques",
				"inventor": "Samoan Communities",
				"year": "ancient",
				"information": {
					"general": "Samoan communities developed intricate tattoos as symbols of identity and status.",
					"description": "Using comb-like tools and ink from soot, designs are tapped into the skin with precision.",
					"extra": "These techniques influenced Polynesian art and remain an important cultural tradition."
				},
				"image": "images/oceania/samoa/tattoo.webp"
			}
		]
	}
]